{"keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "dtype": "float32", "kernel_size": [5, 5], "name": "conv2d_1", "strides": [1, 1], "filters": 6, "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 1], "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "AveragePooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "average_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [5, 5], "name": "conv2d_2", "filters": 16, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "dtype": "float32"}}, {"class_name": "AveragePooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "average_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "dtype": "float32", "name": "dense_1", "activity_regularizer": null, "units": 120, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "softmax", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "dtype": "float32", "name": "dense_2", "activity_regularizer": null, "units": 10, "bias_constraint": null}}]}}